src/oy19_by21_pr15_bp9_mf11/conf/Documents/УстановкаКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаКурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>InformationRegister.КурсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/AccountingRegisters/Проводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Проводки</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Documents/УстановкаКурсов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.КурсыВалют.Очистить();
	Движения.Проводки.Очистить();
	
	Движения.Проводки.Записать();
	
	Движения.КурсыВалют.Записывать = Истина;
	Движения.Проводки.Записывать = Истина;
	
	ТекущийМесяц = НачалоМесяца(Дата);
	
	ВидСубконтоКонтрагент = ПланыВидовХарактеристик.ВидыСубконто.Контрагент;
	ВидСубконтоВалюта     = ПланыВидовХарактеристик.ВидыСубконто.Валюта;
	ВидСубконтоДокумент   = ПланыВидовХарактеристик.ВидыСубконто.Документ;
	
	СчетПокупатели    = ПланыСчетов.Управленческий.Покупатели;
	СчетПрибылиУбытки = ПланыСчетов.Управленческий.ПрибылиУбытки;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Счет", СчетПокупатели);
	ЭлементБлокировки.ИсточникДанных = Курсы;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Субконто1", "Контрагент");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Субконто2", "Валюта");
	Блокировка.Заблокировать();
	
	Для Каждого ТекСтрока Из Курсы Цикл
		Запись = Движения.КурсыВалют.Добавить();
		Запись.Период     = ТекущийМесяц;
		Запись.Валюта     = ТекСтрока.Валюта;
		Запись.Контрагент = ТекСтрока.Контрагент;
		Запись.Курс       = ТекСтрока.Курс;
	КонецЦикла;
	
	// Корректирующие проводки
	Субконто = Новый Массив;
	Субконто.Добавить(ВидСубконтоКонтрагент);
	Субконто.Добавить(ВидСубконтоВалюта);
	Субконто.Добавить(ВидСубконтоДокумент);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УстановкаКурсовКурсы.Контрагент КАК Контрагент,
		|	УстановкаКурсовКурсы.Валюта КАК Валюта,
		|	УстановкаКурсовКурсы.Курс КАК КурсУЕ
		|ПОМЕСТИТЬ втТЧ
		|ИЗ
		|	Документ.УстановкаКурсов.Курсы КАК УстановкаКурсовКурсы
		|ГДЕ
		|	УстановкаКурсовКурсы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроводкиОбороты.Субконто1 КАК Контрагент,
		|	ПроводкиОбороты.Субконто2 КАК Валюта,
		|	ПроводкиОбороты.Субконто3 КАК Документ,
		|	втТЧ.КурсУЕ КАК КурсУЕ,
		|	ЕСТЬNULL(ПроводкиОбороты.СуммаУЕОборот, 0) КАК СуммаУЕОборот,
		|	ЕСТЬNULL(ПроводкиОбороты.СуммаОборот, 0) КАК СуммаОборот,
		|	ВЫБОР ЕСТЬNULL(ПроводкиОбороты.СуммаУЕОборот, 0)
		|		КОГДА 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ПроводкиОбороты.СуммаОборот, 0) / ПроводкиОбороты.СуммаУЕОборот
		|	КОНЕЦ КАК КурсПроводки,
		|	ВЫРАЗИТЬ(ПроводкиОбороты.Субконто3 КАК Документ.РасходнаяНакладная).Курс КАК КурсДокумента
		|ИЗ
		|	втТЧ КАК втТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Обороты(&ДатаНачала, &ДатаОкончания, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели), &Субконто, , , ) КАК ПроводкиОбороты
		|		ПО втТЧ.Контрагент = ПроводкиОбороты.Субконто1
		|			И втТЧ.Валюта = ПроводкиОбороты.Субконто2
		|ГДЕ
		|	втТЧ.КурсУЕ <> ВЫБОР ЕСТЬNULL(ПроводкиОбороты.СуммаУЕОборот, 0)
		|			КОГДА 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ПроводкиОбороты.СуммаОборот, 0) / ПроводкиОбороты.СуммаУЕОборот
		|		КОНЕЦ"
	);
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущийМесяц);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Субконто", Субконто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Проводка = Движения.Проводки.Добавить();
		Проводка.Период = Дата;
		
		Если Выборка.КурсУЕ > Выборка.КурсПроводки Тогда
			Проводка.СчетДт = СчетПокупатели;
			Проводка.СчетКт = СчетПрибылиУбытки;
			Проводка.Сумма  = Выборка.СуммаУЕОборот * (Выборка.КурсУЕ - Выборка.КурсПроводки);
			Проводка.СубконтоДт[ВидСубконтоКонтрагент] = Выборка.Контрагент;
			Проводка.СубконтоДт[ВидСубконтоВалюта]     = Выборка.Валюта;
			Проводка.СубконтоДт[ВидСубконтоДокумент]   = Выборка.Документ;
		Иначе
			Проводка.СчетДт = СчетПрибылиУбытки;
			Проводка.СчетКт = СчетПокупатели;
			Проводка.Сумма  = Выборка.СуммаУЕОборот * (Выборка.КурсПроводки - Выборка.КурсУЕ);
			Проводка.СубконтоКт[ВидСубконтоКонтрагент] = Выборка.Контрагент;
			Проводка.СубконтоКт[ВидСубконтоВалюта]     = Выборка.Валюта;
			Проводка.СубконтоКт[ВидСубконтоДокумент]   = Выборка.Документ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
